# Задача 20:
# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
#
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

list_1 = ["A", "E", "I", "O", "U", "L", "N", "S", "T", "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"]
list_2 = ["D", "G", "Д", "К", "Л", "М", "П", "У"]
list_3 = ["B", "C", "M", "P", "Б", "Г", "Ё", "Ь", "Я"]
list_4 = ["F", "H", "V", "W", "Y", "Й", "Ы"]
list_5 = ["K", "Ж", "З", "Х", "Ц", "Ч"]
list_8 = ["J", "X", "Ш", "Э", "Ю"]
list_10 = ["Q", "Z", "Ф", "Щ", "Ъ"]
dict = {}
for i in list_1:
    dict[i] = 1
for i in list_2:
    dict[i] = 2
for i in list_3:
    dict[i] = 3
for i in list_4:
    dict[i] = 4
for i in list_5:
    dict[i] = 5
for i in list_8:
    dict[i] = 8
for i in list_10:
    dict[i] = 10   
# print(dict)

word = input("Введите слово: ")
cost = 0
for i in word:
    cost += dict[i.upper()]
print(f"Стоимость слова: {cost}")